#include <stdio.h>

void main(void)
{

	int i;
	char *pi;
	char* string = "길라잡이";
	_int64 i64 = 9223372036854775807;

	// 문자, 정수값
	printf("[ %c]	\n", 'A');					// [ A]
	printf("[ %d]	\n", 7);					// [7]
	printf("[ %i]	\n", 7);					// [7]
	printf("[ %5d]	\n", 7);					// [     7]
	printf("[ %05d]	\n", 7);					// [ 00007]
	printf("[ %+d]	\n", -12345);				// [ -12345]
	printf("[ %+d]	\n", 12345);				// [+12345]
	printf("[ % d]	\n", -12345);				// [-12345]
	printf("[ %u]	\n", 12345);				// [12345]
	printf("[ %u]	\n", -12345);				// [4294954951]

	printf("\n");

	// 8진수, 16진수
	printf("[ %x]	\n", 0xFF);					// [ ff]
	printf("[ %X]	\n", 0xFF);					// [ FF]
	printf("[ %#x]	\n", 0xFF);					// [ 0xff]
	printf("[ %#x]	\n", 12345);				//[ 0x3039]
	printf("[ %o]	\n", 0123);					// [ 123]
	printf("[ %#o]	\n", 0123);					// [ 0123]

	printf("\n");

	// 고정소수점
	printf("[ %f]		\n", 3.141592);			// [ 3.141592]
	printf("[ %5f]		\n", 3.141592);			// [ 3.141592]
	printf("[ %.f]		\n", 3.141592);			// [ 3]
	printf("[ %.2f]		\n", 3.141592);			// [ 3.14]
	printf("[ %2.2f]	\n", 3.141592);			// [ 3.14]
	printf("[ %5.5f]	\n", 3.141592);			// [ 3.14159]
	printf("[ %20.5f]	\n", 3.141592);			// [              3.14159]
	printf("[ %-20.5f]	\n", 3.141592);			// [ 3.14159             ]

	printf("\n");

	// 부동소수점
	printf("[ %e]		\n", 3.141592);			// [ 3.141592e+00]
	printf("[ %E]		\n", 3.141592);			// [ 3.141592E+00]
	printf("[ %5e]		\n", 3.141592);			// [ 3.141592e+00]
	printf("[ %.e]		\n", 3.141592);			// [ 3e+00]
	printf("[ %.2e]		\n", 3.141592);			// [ 3.14e+00]
	printf("[ %2.2e]	\n", 3.141592);			// [ 3.14e+00]
	printf("[ %5.5e]	\n", 3.141592);			// [ 3.14159e+00]
	printf("[ %20.5e]	\n", 3.141592);			// [          3.14159e+00]
	printf("[ %20.2E]	\n", 3.141592);			// [             3.14E+00]
	printf("[ %-20.2E]	\n", 3.141592);			// [ 3.14E+00            ]

	printf("\n");

	// 스마트형
	printf("[ %g]	\n", 3.141592);				// [ 3.14159]

	printf("\n");

	// 문자열형
	printf("[ %s]		\n", string);			// [ 길라잡이]
	printf("[ %10s]		\n", string);			// [   길라잡이]
	printf("[ %-10s]	\n", string);			// [ 길라잡이  ]
	printf("[ %2s]		\n", string);			// [ 길라잡이]
	printf("[ %2.2s]	\n", string);			// [ 길]
	printf("[ %3.2s]	\n", string);			// [  길]
	printf("[ %010s]	\n", string);			// [ 00길라잡이]
	
	printf("\n");

	// 포인트형
	printf("[ %p]	\n", &i);					// [ 000000534AF5FB34]
	printf("[ %p]	\n", &pi);					// [ 000000534AF5FB58]

	printf("\n");

	// 64비트 정수값
	printf("[ %I64d]	\n", i64);					// [ 9223372036854775807]

} // main 끝